; domain
(define (domain valueflows)


(:requirements :strips :typing )

(:types 
    thing
    resource - thing 
    actor - thing 
    resourceClass
    location
)

; un-comment following line if constants are needed
;(:constants )

(:predicates 
    (currentLocation ?t - thing ?l - location)
    (resourceClassification ?r - resource ?c - resourceClass )
    (transporter ?a - actor)
    (custodian ?r - resource ?a - actor )
    (primaryAccountable ?r - resource ?a - actor)
    (stationary ?t - thing) ; things that won't move
)


;(:functions )


(:action move 
    :parameters (?r - resource ?a - actor ?fromLocation - location ?toLocation - location)
    :precondition ( and
        (transporter ?a )
        (currentLocation ?r ?fromLocation)
        (currentLocation ?a ?fromLocation)
        (custodian ?r ?a)
        (not(stationary ?a))
        (not(stationary ?r))
    )
    :effect ( and
        (not (currentLocation ?r ?fromLocation))
        (not (currentLocation ?a ?fromLocation))
        (currentLocation ?r ?toLocation)
        (currentLocation ?a ?toLocation)
    )
)

(:action goto
    :parameters (?a - actor ?fromLocation - location ?toLocation - location)
    :precondition 
        (and
            (currentLocation ?a ?fromLocation)
            (not(stationary ?a))
        )
    :effect
        (and
            (not (currentLocation ?a ?fromLocation))
            (currentLocation ?a ?toLocation)
        )
)

(:action transfer-custody
    :parameters (?provider - actor ?receiver - actor ?r - resource ?l - location)
    :precondition (and
        (custodian ?r ?provider)
        (currentLocation ?provider ?l) 
        (currentLocation ?receiver ?l)
        (currentLocation ?r ?l)
        )
    :effect(and
        (not (custodian ?r ?provider))
        (custodian ?r ?receiver)
    )
)

(:action transfer-all-rights
    :parameters (?provider - actor ?receiver - actor ?r - resource)
    :precondition 
        ( and 
            (primaryAccountable ?r ?provider)
        )
    :effect 
        ( and
            (not(primaryAccountable ?r ?provider))
            (primaryAccountable ?r ?receiver)
        )
)

(:action transfer
    :parameters (?provider - actor ?receiver - actor ?r - resource)
    :precondition 
        ( and 
            (custodian ?r ?provider)
            (primaryAccountable ?r ?provider)
            (currentLocation ?provider ?l) 
            (currentLocation ?receiver ?l)
            (currentLocation ?r ?l)
        )
    :effect 
        ( and
            (not(primaryAccountable ?r ?provider))
            (not (custodian ?r ?provider))
            (primaryAccountable ?r ?receiver)
            (custodian ?r ?receiver)            
        )
)


)

; problem
(define 
    (problem simple-move) 
    (:domain valueflows)
(:objects 
    Apples - resource
    Rossatz Krems Wien - location
    Alice Bob Claudia - actor
    GrannySmith - resourceClass
)

(:init
    ;todo: put the initial state's facts and numeric values here
    (currentLocation Apples Rossatz)
    (currentLocation Alice Rossatz)
    (resourceClassification Apples GrannySmith)
    (custodian Apples Alice)
    (primaryAccountable Apples Alice)    
    (currentlocation Claudia Krems)
    (transporter Claudia)
    (currentLocation Bob Wien)
    (stationary Bob)
)

(:goal 
    (and 
        ( custodian Apples Bob)
        (primaryAccountable Apples Bob)
    )
)

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (transfer-all-rights alice bob apples)
   deleted: (primaryaccountable apples alice)
   added: (primaryaccountable apples bob)
   goals met: 1 of 2
2. (goto claudia krems rossatz)
   deleted: (currentlocation claudia krems)
   added: (currentlocation claudia rossatz)
   goals met: 1 of 2
3. (transfer-custody alice claudia apples rossatz)
   deleted: (custodian apples alice)
   added: (custodian apples claudia)
   goals met: 1 of 2
4. (move apples claudia rossatz wien)
   deleted: (currentlocation apples rossatz) (currentlocation claudia rossatz)
   added: (currentlocation apples wien) (currentlocation claudia wien)
   goals met: 1 of 2
5. (transfer-custody claudia bob apples wien)
   deleted: (custodian apples claudia)
   added: (custodian apples bob)
   goals met: 2 of 2
